---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisUtilitiesDBFailures
source: html/93690d57-5b25-92e4-a12c-c605ca3dbc89.htm
---
# BuiltInFailures.EnergyAnalysisUtilitiesDBFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.